In [34]:
import pandas as pd
from datetime import date
import numpy as np
import matplotlib.pyplot as plt

# BOOKSHOP

#### Création dataframes à partir des fichier csv

In [129]:
customers=pd.read_csv('customers.csv')
products=pd.read_csv('products.csv')
transactions=pd.read_csv('transactions.csv')

## Cleaning and preparing

### Dataframe customers

In [130]:
customers

     client_id sex  birth
0       c_4410   f   1967
1       c_7839   f   1975
2       c_1699   f   1984
3       c_5961   f   1962
4       c_5320   m   1943
...        ...  ..    ...
8618    c_7920   m   1956
8619    c_7403   f   1970
8620    c_5119   m   1974
8621    c_5643   f   1968
8622      c_84   f   1982

[8623 rows x 3 columns]

#### Column types

In [131]:
customers.dtypes

client_id    object
sex          object
birth         int64
dtype: object

#### Duplicates

In [132]:
customers.duplicated().sum()

0

#### Nulls

In [133]:
customers.isnull ().any()

client_id    False
sex          False
birth        False
dtype: bool

#### Checking values in sex column

In [134]:
customers['sex'].unique()

array(['f', 'm'], dtype=object)

#### Checking if no extrems values in birth column

In [135]:
customers['birth'].describe()

count    8623.000000
mean     1978.280877
std        16.919535
min      1929.000000
25%      1966.000000
50%      1979.000000
75%      1992.000000
max      2004.000000
Name: birth, dtype: float64

#### Adding age column

In [136]:
customers['age']=date.today().year-customers['birth']
customers

     client_id sex  birth  age
0       c_4410   f   1967   56
1       c_7839   f   1975   48
2       c_1699   f   1984   39
3       c_5961   f   1962   61
4       c_5320   m   1943   80
...        ...  ..    ...  ...
8618    c_7920   m   1956   67
8619    c_7403   f   1970   53
8620    c_5119   m   1974   49
8621    c_5643   f   1968   55
8622      c_84   f   1982   41

[8623 rows x 4 columns]

### Dataframe products

In [137]:
products

     id_prod   price  categ
0     0_1421   19.99      0
1     0_1368    5.13      0
2      0_731   17.99      0
3      1_587    4.99      1
4     0_1507    3.99      0
...      ...     ...    ...
3282    2_23  115.99      2
3283   0_146   17.14      0
3284   0_802   11.22      0
3285   1_140   38.56      1
3286  0_1920   25.16      0

[3287 rows x 3 columns]

#### Column types

In [138]:
products.dtypes

id_prod     object
price      float64
categ        int64
dtype: object

#### Duplicates

In [139]:
products.duplicated().sum()

0

#### Nulls

In [140]:
products.isnull ().any()

id_prod    False
price      False
categ      False
dtype: bool

#### Price column describe

In [141]:
products['price'].describe()

count    3287.000000
mean       21.856641
std        29.847908
min        -1.000000
25%         6.990000
50%        13.060000
75%        22.990000
max       300.000000
Name: price, dtype: float64

#### The minimum price is below 0. Let's check the product(s) with negative value

In [142]:
mask=products['price']<=0
products.loc[mask]

    id_prod  price  categ
731     T_0   -1.0      0

#### Deleting this line

In [143]:
products.drop(products.loc[mask].index,inplace=True)

#Checking
products.loc[mask]

Empty DataFrame
Columns: [id_prod, price, categ]
Index: []

#### Checking uniique values in 'categ' column

In [144]:
products['categ'].unique()

array([0, 1, 2], dtype=int64)

### Dataframe transactions

In [145]:
transactions

       id_prod                        date session_id client_id
0       0_1518  2022-05-20 13:21:29.043970   s_211425     c_103
1        1_251  2022-02-02 07:55:19.149409   s_158752    c_8534
2       0_1277  2022-06-18 15:44:33.155329   s_225667    c_6714
3        2_209  2021-06-24 04:19:29.835891    s_52962    c_6941
4       0_1509  2023-01-11 08:22:08.194479   s_325227    c_4232
...        ...                         ...        ...       ...
679527  0_1551  2022-01-15 13:05:06.246925   s_150195    c_8489
679528   1_639  2022-03-19 16:03:23.429229   s_181434    c_4370
679529  0_1425  2022-12-20 04:33:37.584749   s_314704     c_304
679530  0_1994  2021-07-16 20:36:35.350579    s_63204    c_2227
679531   1_523  2022-09-28 01:12:01.973763   s_274568    c_3873

[679532 rows x 4 columns]

#### Columns types

In [146]:
transactions.dtypes

id_prod       object
date          object
session_id    object
client_id     object
dtype: object

#### The 'date' column need to have his type changed into date/time type

##### After trying it, ValueError: time data test_2021-03-01 02:30:02.237419 doesn't match format specified. Let's have a look

In [147]:
transactions[transactions['date'].str.contains('test')]

       id_prod                             date session_id client_id
3019       T_0  test_2021-03-01 02:30:02.237419        s_0      ct_0
5138       T_0  test_2021-03-01 02:30:02.237425        s_0      ct_0
9668       T_0  test_2021-03-01 02:30:02.237437        s_0      ct_1
10728      T_0  test_2021-03-01 02:30:02.237436        s_0      ct_0
15292      T_0  test_2021-03-01 02:30:02.237430        s_0      ct_0
...        ...                              ...        ...       ...
657830     T_0  test_2021-03-01 02:30:02.237417        s_0      ct_0
662081     T_0  test_2021-03-01 02:30:02.237427        s_0      ct_1
670680     T_0  test_2021-03-01 02:30:02.237449        s_0      ct_1
671647     T_0  test_2021-03-01 02:30:02.237424        s_0      ct_1
679180     T_0  test_2021-03-01 02:30:02.237425        s_0      ct_1

[200 rows x 4 columns]

##### Deleting those rows

In [148]:
transactions.drop(transactions[transactions['date'].str.contains('test')].index,inplace=True)

#Test
transactions[transactions['date'].str.contains('test')]

Empty DataFrame
Columns: [id_prod, date, session_id, client_id]
Index: []

##### Formatating the 'date column:

In [149]:
transactions['date']=pd.to_datetime(transactions['date'],format='%Y-%m-%d')

In [150]:
transactions.dtypes

id_prod               object
date          datetime64[ns]
session_id            object
client_id             object
dtype: object

#### Duplicates

In [151]:
transactions.duplicated().sum()

0

##### Nulls

In [113]:
transactions.isnull().any()

id_prod       False
date          False
session_id    False
client_id     False
dtype: bool

## Checking if each transaction has products and clients linked

#### Merge of dataframes Transactions et products dans dataframe transac_prod

In [152]:
transac_prod=pd.merge(transactions,products, on='id_prod',how='left')
transac_prod

       id_prod                       date session_id client_id  price  categ
0       0_1518 2022-05-20 13:21:29.043970   s_211425     c_103   4.18    0.0
1        1_251 2022-02-02 07:55:19.149409   s_158752    c_8534  15.99    1.0
2       0_1277 2022-06-18 15:44:33.155329   s_225667    c_6714   7.99    0.0
3        2_209 2021-06-24 04:19:29.835891    s_52962    c_6941  69.99    2.0
4       0_1509 2023-01-11 08:22:08.194479   s_325227    c_4232   4.99    0.0
...        ...                        ...        ...       ...    ...    ...
679327  0_1551 2022-01-15 13:05:06.246925   s_150195    c_8489  12.99    0.0
679328   1_639 2022-03-19 16:03:23.429229   s_181434    c_4370  10.99    1.0
679329  0_1425 2022-12-20 04:33:37.584749   s_314704     c_304  12.99    0.0
679330  0_1994 2021-07-16 20:36:35.350579    s_63204    c_2227   4.98    0.0
679331   1_523 2022-09-28 01:12:01.973763   s_274568    c_3873  23.99    1.0

[679332 rows x 6 columns]

In [156]:
transa_prod_cust=pd.merge(transac_prod,customers, on='client_id',how='left')

In [157]:
transa_prod_cust

,id_prod,date,session_id,client_id,price,categ,sex,birth,age
0,0_1518,2022-05-20 13:21:29.043970,s_211425,c_103,4.18,0.0,f,1986,37
1,1_251,2022-02-02 07:55:19.149409,s_158752,c_8534,15.99,1.0,m,1988,35
2,0_1277,2022-06-18 15:44:33.155329,s_225667,c_6714,7.99,0.0,f,1968,55
3,2_209,2021-06-24 04:19:29.835891,s_52962,c_6941,69.99,2.0,m,2000,23
4,0_1509,2023-01-11 08:22:08.194479,s_325227,c_4232,4.99,0.0,m,1980,43
...,...,...,...,...,...,...,...,...,...
679327,0_1551,2022-01-15 13:05:06.246925,s_150195,c_8489,12.99,0.0,f,1951,72
679328,1_639,2022-03-19 16:03:23.429229,s_181434,c_4370,10.99,1.0,f,1977,46
679329,0_1425,2022-12-20 04:33:37.584749,s_314704,c_304,12.99,0.0,f,1988,35
679330,0_1994,2021-07-16 20:36:35.350579,s_63204,c_2227,4.98,0.0,m,1986,37
679331,1_523,2022-09-28 01:12:01.973763,s_274568,c_3873,23.99,1.0,m,1995,28

##### Nulls

In [158]:
transa_prod_cust.isnull().any()

id_prod       False
date          False
session_id    False
client_id     False
price          True
categ          True
sex           False
birth         False
age           False
dtype: bool

#### Display of transactions with no products prices and categories

In [160]:
transa_prod_cust[pd.isnull(transa_prod_cust['price'])]

,id_prod,date,session_id,client_id,price,categ,sex,birth,age
2633,0_2245,2022-09-23 07:22:38.636773,s_272266,c_4746,NaN,NaN,m,1940,83
10103,0_2245,2022-07-23 09:24:14.133889,s_242482,c_6713,NaN,NaN,f,1963,60
11723,0_2245,2022-12-03 03:26:35.696673,s_306338,c_5108,NaN,NaN,m,1978,45
15670,0_2245,2021-08-16 11:33:25.481411,s_76493,c_1391,NaN,NaN,m,1991,32
16372,0_2245,2022-07-16 05:53:01.627491,s_239078,c_7954,NaN,NaN,m,1973,50
...,...,...,...,...,...,...,...,...,...
669533,0_2245,2021-08-25 09:06:03.504061,s_80395,c_131,NaN,NaN,m,1981,42
670484,0_2245,2022-03-06 19:59:19.462288,s_175311,c_4167,NaN,NaN,f,1979,44
671088,0_2245,2022-05-16 11:35:20.319501,s_209381,c_4453,NaN,NaN,m,1981,42
675480,0_2245,2022-02-11 09:05:43.952857,s_163405,c_1098,NaN,NaN,m,1986,37
677797,0_2245,2021-12-14 22:34:54.589921,s_134446,c_4854,NaN,NaN,m,1968,55

#### Replacing the missing values

In [161]:
#Calculation of average price ofr each category
prix_categ=transa_prod_cust.groupby('categ')['price'].mean()

In [162]:
#Getting the indexes of the rows with missing values
index_rows_noprice=transa_prod_cust[pd.isnull(transa_prod_cust['price'])].index

In [163]:
#Loop to replace the missing value (the first character of the 'id_prod' corresponds to the category product)
for i in index_rows_noprice:
    if transa_prod_cust.loc[i,'id_prod'][:1]=='0':            
        transa_prod_cust.loc[i,'price']=prix_categ[0]
        transa_prod_cust.loc[i,'categ']=0
    elif transa_prod_cust.loc[i,'id_prod'][:1]=='1':
        transa_prod_cust.loc[i,'price']=prix_categ[1]
        transa_prod_cust.loc[i,'categ']=1
    else:
        transa_prod_cust.loc[i,'price']=prix_categ[2]
        transa_prod_cust.loc[i,'categ']=2

#### Checking

In [164]:
transa_prod_cust.isnull().any()

id_prod       False
date          False
session_id    False
client_id     False
price         False
categ         False
sex           False
birth         False
age           False
dtype: bool

In [165]:
transa_prod_cust.loc[677797]

id_prod                           0_2245
date          2021-12-14 22:34:54.589921
session_id                      s_134446
client_id                         c_4854
price                          10.638188
categ                                0.0
sex                                    m
birth                               1968
age                                   55
Name: 677797, dtype: object

#### Export

In [166]:
transa_prod_cust.to_csv('Bookshop_cleaned.csv', index=False)